app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@service = Service.find(params[:service_id])
		@users = @service.users.all

INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 12 Nov 2011 03:03:33 UTC +00:00], ["email", "courtzie@owlcabi.net"], ["password", "test2"], ["updated_at", Sat, 12 Nov 2011 03:03:33 UTC +00:00], ["username", "Courtziejayne"]]
---
	def create
		@service = Service.find(params[:service_id])
		@user = @service.users.create(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def show
		@service = Service.find(params[:service_id])
		@user = @service.users.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def edit
		@service = Service.find(params[:service_id])
		@user = @service.users.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = 'test1@owlcabi.net', "updated_at" = '2011-11-12 03:12:22.770958' WHERE "users"."id" = 1
---
	def update
		@service = Service.find(params[:service_id])
		@user = @service.users.find(params[:id])

		respond_to do |format|
			if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
	def destroy
		@service = Service.find(params[:service_id])
		@user = @service.users.find(params[:id])
		@user.destroy